app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @users = User.all
    @books = Book.all

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "ああああああああああ"], ["body", "ああああああああああ"], ["created_at", "2019-05-31 03:36:51.855873"], ["updated_at", "2019-05-31 03:36:51.855873"], ["user_id", 3]]
---
  def create
    @books = Book.all
    @book = current_user.books.new(book_params)
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def correct_user
      book = Book.find(params[:id])