app/controllers/users_controller.rb

  def update
    if current_user.update(user_params)
---
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "578f21b1fe9a65fe5417cca052d6680ab8b34715f1e6fcbeb64de1b65a23"], ["introduction", ""], ["updated_at", "2019-05-31 00:45:30.943074"], ["id", 1]]